app/views/books/_form.html.erb

      <%= form.label :category_id, "Collection", class: "text-xs font-black text-slate-400 uppercase tracking-widest ml-1" %>
      <%= form.collection_select :category_id, Category.all, :id, :name,
          { prompt: "Select a Category" },
          { class: "input-animated block w-full px-6 py-4 bg-white border border-slate-200 rounded-2xl text-slate-900 font-medium focus:ring-4 focus:ring-violet-500/10 appearance-none" } %>
---
SELECT "categories".* FROM "categories"