app/views/books/index.html.erb

      <h1 class="text-3xl font-bold text-slate-900">Library</h1>
      <p class="mt-2 text-sm text-slate-500">A collection of <%= pluralize(@books.count, "book") %> across all categories.</p>
---
SELECT "books".* FROM "books"
SELECT COUNT(*) FROM "books"