app/controllers/books_controller.rb

SELECT "books".* FROM "books" ORDER BY "books"."created_at" DESC LIMIT 1
---
  def index
    @books = if params[:search].present?
               Book.where('title LIKE ? OR author LIKE ?', "%#{params[:search]}%", "%#{params[:search]}%")
             else
               Book.all

INSERT INTO "books" ("title", "author", "price", "published_on", "created_at", "updated_at", "category_id") VALUES ('soham chavan', 'me', 150.0, NULL, '2025-12-09 10:22:21.580279', '2025-12-09 10:22:21.580279', 3) RETURNING "id"
---
  def create
    @book = Book.new(book_params)
    if @book.save